Дошкольное_учреждение83/src/DataProcessors/удуФормированиеСпискаРаботников/удуФормированиеСпискаРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>удуФормированиеСпискаРаботников</name>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУволенных</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьУволенных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбиратьСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьДоговорников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпределятьДатыПриемаУвольнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Дошкольное_учреждение83/src/Catalogs/удуСотрудникиОрганизаций/удуСотрудникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуСотрудникиОрганизаций</name>
  <basedOn>Catalog.ФизическиеЛица</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.удуВидыДоговоровСФизЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.удуВидыЗанятостиВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/DataProcessors/удуФормированиеСпискаРаботников/Forms/ФормаНастройки/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПоместитьВХранилище(ДанныеДляХранилища)
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляХранилища, УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция ПроверитьВозможностьРедактирования(ПолеКомпоновки)
	
	ЭлементСписка=СтруктураНедоступногоОтбора.НайтиПоЗначению(ПолеКомпоновки);
	ЗначениеДляВозврата = ?(ЭлементСписка=Неопределено,истина,Ложь);
			
	Возврат ЗначениеДляВозврата;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокРаботниковСервер()
	
	ТЗРаботники=Обработки.удуФормированиеСпискаРаботников.ПолучитьСписокРаботников(Объект);
	АдресДанныхПоРаботникам=ПоместитьВХранилище(ТЗРаботники);

	Возврат АдресДанныхПоРаботникам;
	
КонецФункции



 &НаСервере
 // Инициализирует обработку для подготовки списка работников, отобранного по указанным пользователем критериям.
//
// ДатаАктуальности - дата, по состоянию на которую осматривается список работников
// Организация - ссылка на организацию (может быть в том числе обособленным подразделением), если передана пустая ссылка, выбираются 
//					работники всех организаций
// Подразделение - ссылка на подразделение, если передана пустая ссылка, выбираются 
//					работники всех подразделений
// 
Процедура ИнициализироватьОтборСпискаРаботников(ДатаАктуальности, Организация = Неопределено, Подразделение = Неопределено)
	
		
	Обработки.удуФормированиеСпискаРаботников.ЗаполнитьНачальныеНастройки(Объект);
	 
	Объект.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	// Переданную организацию пропишем независимо от сохраненных ранее настроек отбора
		
		ЭлементПараметрыДанных=Объект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ГоловнаяОрганизация");
		ЭлементПараметрыДанных.Использование=Истина;
		ЭлементПараметрыДанных.Значение=?(Организация=Неопределено,Справочники.удуУчреждения.ПустаяСсылка(),Организация);
				
		удуУправлениеОтчетами.УстановитьОтбор(Объект.КомпоновщикНастроек.Настройки, "Организация", ?(Организация=Неопределено,Справочники.удуУчреждения.ПустаяСсылка(),Организация),
		ВидСравненияКомпоновкиДанных.Равно,"", ЗначениеЗаполнено(Организация));
		
		Если ЗначениеЗаполнено(Организация) тогда
			 СтруктураНедоступногоОтбора.Добавить(Новый ПолеКомпоновкиДанных("Организация"));
		КонецЕсли;
		
		удуУправлениеОтчетами.УстановитьОтбор(Объект.КомпоновщикНастроек.Настройки, "Подразделение", ?(Подразделение=Неопределено,Справочники.удуПодразделенияУчереждения.ПустаяСсылка(),Подразделение),
		ВидСравненияКомпоновкиДанных.Равно,"", ЗначениеЗаполнено(Подразделение));
				
		Если ЗначениеЗаполнено(Подразделение) Тогда
			СтруктураНедоступногоОтбора.Добавить(Новый ПолеКомпоновкиДанных("Подразделение"));
		КонецЕсли;
		
		удуУправлениеОтчетами.УстановитьОтбор(Объект.КомпоновщикНастроек.Настройки, "Должность", Справочники.Должности.ПустаяСсылка(),ВидСравненияКомпоновкиДанных.Равно,"", Ложь);
		удуУправлениеОтчетами.УстановитьОтбор(Объект.КомпоновщикНастроек.Настройки, "Сотрудник", Справочники.удуСотрудникиОрганизаций.ПустаяСсылка(),ВидСравненияКомпоновкиДанных.ВСписке,"", Ложь);
		
	
КонецПроцедуры  


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ДатаАктуальности;
	Перем Организация;
	Перем Подразделение;
	Перем НеПоказыватьУволенных;
	Перем ДатаУволенных;
	Перем ВключатьУволенных;
	
	
	СтруктураНачальногоЗаполнения=ПолучитьИзВременногоХранилища(Параметры.АдресДанныхНачальногоЗаполнения);
	СтруктураНачальногоЗаполнения.Свойство("ДатаАктуальности",ДатаАктуальности);
	СтруктураНачальногоЗаполнения.Свойство("Организация",Организация);
	СтруктураНачальногоЗаполнения.Свойство("Подразделение",Подразделение);
	СтруктураНачальногоЗаполнения.Свойство("НеПоказыватьУволенных",НеПоказыватьУволенных);
	СтруктураНачальногоЗаполнения.Свойство("ДатаУволенных",ДатаУволенных);
	СтруктураНачальногоЗаполнения.Свойство("ВключатьУволенных",ВключатьУволенных);
	
	
	Объект.ДатаАктуальности		= ДатаАктуальности;
	Объект.ДатаУволенных			= ?(ДатаУволенных = Неопределено, НачалоГода(ДатаАктуальности), ДатаУволенных);
	Объект.ВключатьУволенных	    = ?(ВключатьУволенных=Неопределено,Объект.ВключатьУволенных,ВключатьУволенных);
	Объект.Организация = ?(Организация=Неопределено,Объект.Организация,Организация);
	
	
	НеПоказыватьУволенных=?(НеПоказыватьУволенных=Неопределено,Ложь,НеПоказыватьУволенных);
	
	СтруктураНедоступногоОтбора.Очистить();
		
	ИнициализироватьОтборСпискаРаботников(ДатаАктуальности, Организация, Подразделение);
	
	Элементы.ГруппаПоУволенным.Видимость = не НеПоказыватьУволенных;


	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ВыполнитьПодбор(Команда)
	
	АдресСписка = ПолучитьСписокРаботниковСервер();
	
	СтруктураВыбора=Новый Структура("Команда,АдресДанных,ДатаАктуальности","ЗаполнитьСписокРаботников",АдресСписка,Объект.ДатаАктуальности);
		
	ОповеститьОВыборе(СтруктураВыбора);
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ КомпоновщикНастроекНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	
	СтрокаТЧ=Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Отказ=не ПроверитьВозможностьРедактирования(СтрокаТЧ.ЛевоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередУдалением(Элемент, Отказ)
	
	Отказ= не ПроверитьВозможностьРедактирования(Элемент.ТекущиеДанные.ЛевоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборЛевоеЗначениеПриИзменении(Элемент)
	
	Идентификатор=Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	ЭлементОтбора=Объект.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Идентификатор);		 
			 
			 
	Если не ПроверитьВозможностьРедактирования(ЭлементОтбора.ЛевоеЗначение) тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст="Отбор по полю """+строка(ЭлементОтбора.ЛевоеЗначение)+""" уже установлен";
		СообщениеПользователю.Сообщить();
		ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных(мПолеКомпоновки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока тогда
		мПолеКомпоновки="";
	Иначе 
		мПолеКомпоновки=Элемент.ТекущиеДанные.ЛевоеЗначение;
	КонецЕсли;
	
КонецПроцедуры
